/* eslint-disable */

// Script for early-state development of the UI module.

import { App, LyricsWindow } from "@open-orpheus/ui";

import { createApp, getApp } from "../src/main/ui";
import { loadSkinPack, loadWebPack, skinPack, webPack } from "../src/main/pack";
import { parseLrc } from "../src/main/lyrics";

setInterval(() => {
  // keep alive
}, 1000);

// no GC
let lw: LyricsWindow | null = null;

async function main() {
  await loadWebPack();
  await webPack.readPack();

  await loadSkinPack("common");
  await skinPack.readPack();

  await createApp();
  await getApp().loadMenuSkin("/menu/skin.xml");

  lw = await LyricsWindow.create(getApp());
  console.log(lw);
  const lrc = parseLrc(
    `[00:04.316]ぬばたまの夜更けし
[00:08.678]明くるを待ち 七の想灯
[00:23.215]夢の中に囁く声
[00:25.906]君は誰と 探し求め
[00:28.494]現の闇紛れて
[00:31.097]憂世の道 照らしてくれ
[00:33.862]心の虚を埋めて
[00:36.291]無為に言葉 拾い集め
[00:38.964]寂しげな記憶を
[00:41.614]黄泉国へ 全て捨てさせて
[00:46.065]一つ問えば 二つ合わせ
[00:51.091]三つの更の 四方に籠目
[00:56.444]五つぎぬに 六道はずれ 七つのかげ
[01:04.029]咲き狂え彼岸花
[01:09.326]染まる色に嗤え
[01:14.768]渡り舟 棹させば
[01:19.870]あらざらむ世を見ばや
[01:29.275]口からは尋ねる声
[01:31.862]私は誰 迷い求め
[01:34.480]常世の闇纏いて
[01:36.994]修羅の道に 導いてくれ
[01:39.995]人の情を断ち切れ
[01:42.215]葬り火に 怪し殺め
[01:44.965]愛し恋し空蝉
[01:47.509]賽河原 石を積み上げて
[01:51.792]一人ゆけば 二つに散れ
[01:56.879]三途の定め 四苦を違え
[02:02.263]五蘊に満て 六根けがれ 七つかけら
[02:10.109]枯れ果てた此岸花
[02:15.301]燃ゆる色に泣いて
[02:20.549]渡瀬に 足つけば
[02:25.741]恨みざらむ世を見ばや
[02:31.278]玉の緒の絶えなば絶えね命よ
[02:36.930]偲ぶることすら儘ならぬ
[02:42.327]さりとて漂え なれば流され
[02:47.575]剰え罪重ぬるなら
[02:52.039]黄泉還れ あやかしに
[02:57.422]百鬼の夜に全て喰らえ
[03:02.705]紅の跡を辿って
[03:07.935]此世の涯まで
[03:14.202]よこしまの夜更けし
[03:18.608]飽くるを断ち 七の
[03:30.000]后期：贼恩
[03:30.500]图素：阴阳师手游面灵气绘卷
[03:31.000]曲绘：KRR
[03:31.500]
[03:32.000]监制：红衣、小穆
[03:31.500]PV：N-N
[03:32.000]
`,
    `[by:药名为恨]
[00:04.316]【阑珊夜中不见】
[00:08.678]【七之思绪 静待天明】
[00:23.215]【有谁在梦中轻语】
[00:25.906]【寻寻觅觅 探寻我名】
[00:28.494]【有谁在梦醒暗中】
[00:31.097]【却求它能 照亮尘世】
[00:33.862]【为排解心中空虚】
[00:36.291]【盲目捡拾 碎语闲言】
[00:38.964]【且把那悲哀寂寥】
[00:41.614]【尽数丢在 黄泉路上】
[00:46.065]【一问而二合】
[00:51.091]【三更徒四壁】
[00:56.444]【五衣见者 六道超脱 乃为七之泡影】【※五衣：平安时代女性服饰十二单的下面五件衣服】
[01:04.029]【让那彼岸花怒放】
[01:09.326]【于渐染色中嘲笑】
[01:14.768]【划着河上那扁舟】
[01:19.870]【去见那非人之世】
[01:29.275]【口中呼唤的声音】
[01:31.862]【我又是谁 懵懵懂懂】
[01:34.480]【周身环绕的黑暗】
[01:36.994]【却求它能 引路修罗】
[01:39.995]【斩断那七情六欲】
[01:42.215]【于葬火中 怪异害人】
[01:44.965]【至于那儿女情长】
[01:47.509]【赛之河原 垒石以念】
[01:51.792]【一去而二化】
[01:56.879]【三途违四苦】
[02:02.263]【五蕴满盈 六根污秽 乃为七之元神】
[02:10.109]【看那此岸花枯萎】
[02:15.301]【于燃尽色中哭泣】
[02:20.549]【把脚探进河水中】
[02:25.741]【去见那无恨之世】
[02:31.278]【此身欲绝 怎堪无术】
[02:36.930]【纵是坚忍 亦求不得】
[02:42.327]【飘摇无定 随波逐流】
[02:47.575]【欲加之罪 何患无辞】
[02:52.039]【就化为魑魅魍魉】
[02:57.422]【百鬼之夜 噬尽一切】
[03:02.705]【循着那血红痕迹】
[03:07.935]【直至此世之涯】
[03:14.202]【邪魅夜中不见】
[03:18.608]【七之面火 煞性无终】`
  );
  lw.setData(lrc);
  const startTime = Date.now();
  setInterval(() => {
    const currentTime = Date.now() - startTime;
    console.log(currentTime);
    lw.setTime(currentTime);
  }, 10);
}

main();
